# Выведите три различные строки.

print("First string")
print("Second string")
print("Third string")