# Напишите программу, которая будет выводить одно сообщение, если значе-
# ние переменной меньше 10, и другое, если переменная больше или равна 10.

a = 11

if a < 10:
    print('a is less than 10')
elif a == 10:
    print('a equal to 10')
else: print('a more than 10')