# Напишите программу, которая выполняет деление двух чисел и выводит остаток.

a = 15 % 4
print(a)
