# Напишите программу, которая принимает две переменные, делит одну на другую и выводит частное

a = 14
b = 4
c = a // b
print(c)