# Напишите программу, которая будет выводить разные строки в зависимости
# от того, какое целое число было вами присвоено переменной age, содержа-
# щейся в этой программе.

age = 23

if age < 10:
    print('Test for age < 10')
elif age > 10 and age < 34:
    print('Test for age > 10 and age < 34')