# Создайте словарь, содержащий различные данные о вас: рост, любимый
# цвет, любимый актер и т.д.

rquis = {"рост":"123", "цвет глаз":"зеленый", "вес":"34"}
print(rquis)